[
    {
        "title": "KMeans\n\n",
        "body": "Welcome to the KMeans Demo Panel! This interactive environment lets you explore how clustering works. A centroid is a gray sphere. All points in the same cluster will share the same color (red, green, blue, etc.), making it easy to visually understand groupings. Below are the key actions you can take:\n• <b>Sample</b> – Tap the “Sample” button to create a fresh set of data points. Use it anytime you want to get a new set of points.\n• <b>Initialize Method</b> - Tap this to initialize the algorithms.\n• <b>Step</b> – Press “Step” to run one full iteration of the K‑means algorithm. It reassigns every point to its nearest centroid, then updates each centroid's position to the new cluster mean. Ideal for observing the algorithm converge step-by-step.\n• <b>Reset</b> – Hit “Reset” to wipe everything clean. \n• <b>Grab & Move</b>: In Meta Quest, you can pinch or grab a centroid sphere and drag it around the canvas. As you move a centroid, all points will dynamically switch clusters in real time, helping you visualize how centroid placement impacts clustering. \n You can also change the number of centroids and the density of points on the screen by using the sliders in the left menu.\nHave fun exploring!"
    },
    {
        "title": "SVM (One vs One)\n\n",
        "body": "Welcome to the SVM Demo Panel! This interactive environment helps you understand how a linear Support Vector Machine (SVM) learns to separate two classes of points. The separating boundary (decision line) is drawn directly on the canvas.\n• <b>Sample</b> – Tap the “Sample” button to generate new points.\n• <b>Initialize Method</b> - Tap this to initialize the algorithms.\n• <b>Step</b> – Press “Step” to run one training iteration. The SVM updates its decision boundary using hinge loss. Watch the line shift and tilt to better separate the red and blue points.\n• <b>Reset</b> – Hit “Reset” to clear all points and remove the decision plane. It also resets the learned weights.\nTry stepping multiple times and watch how the boundary changes!"
    },
    {
        "title": "MLP Demo Panel\n\n",
        "body": "Welcome to the MLP Demo Panel! This interactive environment shows how a multilayer perceptron learns to classify points generated by your chosen distribution. Each point is recolored red or blue based on the MLP’s current prediction, and you can watch the network’s loss evolve in real time.\n• <b>Sample</b> – Tap “Sample” to generate a fresh dataset of points according to the density slider.\n• <b>Initialize Method</b> - Tap this to initialize the algorithms.\n• <b>Step</b> – Press “Step” to perform one gradient descent update over all samples.\n• <b>Reset</b> – Hit “Reset” to clear all points and reset the MLP’s weights and loss to their initial state. Use this when you want to start a new experiment.\nUse the <b>Density</b> slider to control how many points are sampled per blob. Higher densities provide more training examples but will take slightly longer per training step. Keep an eye on the <b>Current Loss</b> below to track how training progresses. Enjoy exploring how deep learning shapes decision boundaries! \n<b>Current loss:</b> <loss>"
      }
]
